WELCOME_MESSAGE = 'Привет! Добро пожаловать в игру «Я чувствую лабиринт»!'

WELCOME_NEXT_1_TEXT = 'Что это за игра? Давай расскажу!\n' \
                      'Тебе необходимо найти выход из лабиринта.\n' \
                      'Звучит не сложно, правда?\n' \
                      'Но есть одна загвоздка — ты не видишь сам лабиринт, ' \
                      'всю информацию ты будешь ' \
                      'получать из текстового описания чувств и ощущений.'

WELCOME_NEXT_RULE_TEXT = 'Рад что ты спросил, давай расскажу правила:\n' \
                         'После начала игры будет сгенерирован случайный ' \
                         'лабиринт, размером 10 x 10 клеток.\n' \
                         'У тебя будет четыре кнопки: Вперёд, Направо, Вниз, ' \
                         'Влево. Нажимая на кнопки ты будешь перемещаться по ' \
                         'лабиринту.\n' \
                         'Если ты подойдёшь к стене, то некоторые кнопки ' \
                         'перемещения пропадут.\n' \
                         'Твоя задача выйти из лабиринта пока не закончится ' \
                         'реальное время, а также за минимальное игровое ' \
                         'время.\n' \
                         'Но не всё так просто, у нас ' \
                         'не обычный лабиринт, в нём когда-то жила магия. Из' \
                         '-за этого в нём можно встретить опасности...\n'

WELCOME_NEXT_RULE_2_TEXT = 'Ох, самые разнообразные...' \
                           'Например:\n' \
                           '1) Жара (уменьшает оставшееся время).\n' \
                           '2) Мороз (увеличивает время прохождения клетки)' \
                           '.\n' \
                           '3) Топь (ещё сильнее увеличивает время' \
                           ' прохождения клетки).\n' \
                           '...\n' \
                           'Всего и не вспомнить... но ты не переживай,' \
                           'освоишься по ходу.'

WELCOME_NEXT_RULE_3_TEXT = 'Мы называем эти препятствия - эффектами.\n' \
                           'Когда ты с ними встретишься, то будет выбор: ' \
                           'ничего не делать, или воспользоваться одним из ' \
                           'нескольких предметов. Но запомни, предметы не ' \
                           'бесконечны, так что старайся не попадаться на ' \
                           'такие клетки.'

WELCOME_START_GAME_TEXT = 'Конечно, погнали!'

CREATE_ROOM_TEXT = 'Создать комнату'
JOIN_TO_ROOM_TEXT = 'Присоединиться к комнате'
LEAVE_ROOM_TEXT = 'Покинуть комнату'
CHOOSE_ACTION_TEXT = 'Выберите действие:'

ROOM_SUCCESS_CREATE_TEXT = 'Комната успешно создана, её номер: {}'
ROOM_ERROR_CREATE_TEXT = 'Ошибка при создании комнаты, повторите запрос'

ROOM_SUCCESS_LEAVE_TEXT = 'Вы успешно вышли из комнаты'
ROOM_ERROR_LEAVE_TEXT = 'Ошибка при выходе из комнаты, повторите запрос'

PARTICIPANT_ALREADY_IN_ROOM = 'Вы уже находитесь в комнате!'
PARTICIPANT_NOT_IN_ROOM = 'Вы не состоите в комнате'

ENTER_ROOM_NUMBER_TEXT = 'Введите номер комнаты:'
LOGIN_SUCCESS_IN_ROOM_NUMBER_TEXT = 'Вы зашли в комнату!'
LOGIN_ERROR_IN_ROOM_NUMBER_TEXT = 'Неверный номер комнаты, введите номер ещё' \
                                  ' раз: '

BUTTON_BACK_TEXT = 'Назад'
BUTTON_START_GAME_TEXT = 'Начать игру'

IN_MENU_TEXT = 'Вы вышли в меню'
START_GAME_TEXT = 'Игра запущена, желаем удачи!'

BUTTON_FORWARD = 'Вперёд'
BUTTON_RIGHT = 'Направо'
BUTTON_BACK = 'Назад'
BUTTON_LEFT = 'Налево'

CANT_MOVE_TEXT = '⚠️ Вы не можете двигаться {}!'
ALREADY_EXISTED_TEXT = '🤔 Кажется я тут уже был...'
NEW_WAY_TEXT = 'Новый ход...'
